Hyvok/ARM-induction-heater-controller/src/stm32f30x_new.h
/* New header for the STM32F30x series of ARM Cortex-M4 microcontrollers. */ 

// Memory type defines
#define _MMIO_DWORD(mem_addr) (*(volatile uint32_t *)(mem_addr))
#define _SFR_MEM32(mem_addr) _MMIO_DWORD(mem_addr)

typedef volatile uint32_t register32_t;
typedef volatile uint16_t register16_t;
typedef volatile uint8_t register8_t;

// Registers for advanced control timers TIM1 and TIM8
typedef struct 
{
    register32_t CR1;                           // Control register 1, 0x00
    register32_t CR2;                           // Control register 2, 0x04
    register32_t SMCR;                          // Slave mode control register, 0x08
    register32_t DIER;                          // DMA/enable interrupt register, 0x0C
    register32_t SR;                            // Status register, 0x10
    register32_t EGR;                           // Event generation register, 0x14
    register32_t CCMR1;                         // Capture/compare mode register 1, 0x18
    register32_t CCMR2;                         // Capture/compare mode register 2, 0x1C
    register32_t CCER;                          // Capture/compare enable register, 0x20
    register32_t CNT;                           // Counter, 0x24
    // TODO: PSC is 16bit register?
    register32_t PSC;                           // Prescaler, 0x28
    register32_t ARR;                           // Auto-reload register, 0x2C
    register32_t RCR;                           // Repetition counter register, 0x30
    register32_t CCR1;                          // Capture/compare register 1, 0x34
    register32_t CCR2;                          // Capture/compare register 2, 0x38
    register32_t CCR3;                          // Capture/compare register 3, 0x3C
    register32_t CCR4;                          // Capture/compare register 4, 0x40
    register32_t BDTR;                          // Break and dead-time register, 0x44
    register32_t DCR;                           // DMA control register, 0x48
    register32_t DMAR;                          // DMA address for full transfer, 0x4C
    register32_t reserved_0x50;
    register32_t CCMR3;                         // Capture/compare mode register 3, 0x54
    register32_t CCR5;                          // Capture/compare register 5, 0x58
    register32_t CCR6;                          // Capture/compare register 6, 0x5C
    register32_t OR;                            // Option registers, 0x60
} AC_TIM_t;

struct enum
{
    AC_TIM_CR1_UIFREMAP_EN_gc       = (0x01<<11),
    AC_TIM_CR1_UIFREMAP_DIS_gc      = (0x00<<11),
    AC_TIM_CR1_CKD_NODIV_gc         = (0x00<<8),
    AC_TIM_CR1_CKD_DIVBY2_gc        = (0x01<<8),
    AC_TIM_CR1_CKD_DIVBY4_gc        = (0x02<<8),
    AC_TIM_CR1_CKD_DIVBY2_gc        = (0x01<<8),
    AC_TIM_CR1_ARPE_BUF_gc          = (0x01<<7),
    AC_TIM_CR1_ARPE_UNBUF_gc        = (0x01<<7),
    AC_TIM_CR1_CMS_EDGE_gc          = (0x00<<5),_
    AC_TIM_CR1_CMS_CENTER1_gc       = (0x01<<5),
    AC_TIM_CR1_CMS_CENTER2_gc       = (0x02<<5),
    AC_TIM_CR1_CMS_CENTER3_gc       = (0x03<<5),
    AC_TIM_CR1_DIR_UP_gc            = (0x00<<4),
    AC_TIM_CR1_DIR_DOWN_gc          = (0x01<<4),
    AC_TIM_CR1_OPM_EN_gc            = (0x00<<3),
    AC_TIM_CR1_OPM_DIS_gc           = (0x01<<3),
    AC_TIM_CR1_URS_ANY_gc           = (0x00<<2),
    AC_TIM_CR1_URS_ONLYOFUF_gc      = (0x00<<2),
    AC_TIM_CR1_UDIS_EN_gc           = (0x00<<1),
    AC_TIM_CR1_UDIS_DIS_gc          = (0x01<<1),
    AC_TIM_CR1_CEN_EN_gc            = (0x01<<0),
    AC_TIM_CR1_CEN_DIS_gc           = (0x00<<0)
} AC_TIM_CR1_t;

#define AC_TIM_CR1_UIFREMAP_bm      (0x01<<11)
#define AC_TIM_CR1_CKD_bm           (0x03<<8)
#define AC_TIM_CR1_ARPE_bm          (0x01<<7)
#define AC_TIM_CR1_CMS_bm           (0x03<<5)
#define AC_TIM_CR1_DIR_bm           (0x01<<4)
#define AC_TIM_CR1_OPM_bm           (0x01<<3)
#define AC_TIM_CR1_URS_bm           (0x01<<2)
#define AC_TIM_CR1_UDIS_bm          (0x01<<1)
#define AC_TIM_CR1_CEN_bm           (0x01<<0)

struct enum
{
    AC_TIM_CR2_MMS2_RES_gc                  = (0x00<<20),
    AC_TIM_CR2_MMS2_EN_gc                   = (0x01<<20),
    AC_TIM_CR2_MMS2_UPDATE_gc               = (0x02<<20),
    AC_TIM_CR2_MMS2_CMPPULS_gc              = (0x03<<20),
    AC_TIM_CR2_MMS2_COMP_OC1REF_gc          = (0x04<<20),
    AC_TIM_CR2_MMS2_COMP_OC2REF_gc          = (0x05<<20),
    AC_TIM_CR2_MMS2_COMP_OC3REF_gc          = (0x06<<20),
    AC_TIM_CR2_MMS2_COMP_OC4REF_gc          = (0x07<<20),
    AC_TIM_CR2_MMS2_COMP_OC5REF_gc          = (0x08<<20),
    AC_TIM_CR2_MMS2_COMP_OC6REF_gc          = (0x09<<20),
    AC_TIM_CR2_MMS2_CMPPULS_OC4REF_gc       = (0x0A<<20),
    AC_TIM_CR2_MMS2_CMPPULS_OC6REF_gc       = (0x0B<<20),
    AC_TIM_CR2_MMS2_CMPPULS_OC46REF_RIS_gc  = (0x0C<<20),
    AC_TIM_CR2_MMS2_CMPPULS_OC46REF_FALL_gc = (0x0D<<20),
    AC_TIM_CR2_MMS2_CMPPULS_OC56REF_RIS_gc  = (0x0E<<20),
    AC_TIM_CR2_MMS2_CMPPULS_OC56REF_FALL_gc = (0x0F<<20),
    AC_TIM_CR2_OIS6_0_gc                    = (0x00<<18),
    AC_TIM_CR2_OIS6_1_gc                    = (0x01<<18),
    AC_TIM_CR2_OIS5_0_gc                    = (0x00<<16),
    AC_TIM_CR2_OIS5_1_gc                    = (0x01<<16),
    AC_TIM_CR2_OIS4_0_gc                    = (0x00<<14),
    AC_TIM_CR2_OIS4_1_gc                    = (0x01<<14),
    AC_TIM_CR2_OIS3N_0_gc                   = (0x00<<13),
    AC_TIM_CR2_OIS3N_1_gc                   = (0x01<<13),
    AC_TIM_CR2_OIS3_0_gc                    = (0x00<<12),
    AC_TIM_CR2_OIS3_1_gc                    = (0x01<<12),
    AC_TIM_CR2_OIS2N_0_gc                   = (0x00<<11),
    AC_TIM_CR2_OIS2N_1_gc                   = (0x01<<11),
    AC_TIM_CR2_OIS2_0_gc                    = (0x00<<10),
    AC_TIM_CR2_OIS2_1_gc                    = (0x01<<10),
    AC_TIM_CR2_OIS1_0_gc                    = (0x00<<9),
    AC_TIM_CR2_OIS1_1_gc                    = (0x01<<9),
    AC_TIM_CR2_TI1S_CH1_gc                  = (0x00<<7),
    AC_TIM_CR2_TI1S_XOR_gc                  = (0x01<<7),
    AC_TIM_CR2_MMS_RES_gc                   = (0x00<<4),
    AC_TIM_CR2_MMS_EN_gc                    = (0x01<<4),
    AC_TIM_CR2_MMS_UPDATE_gc                = (0x02<<4),
    AC_TIM_CR2_MMS_CMPPULS_gc               = (0x03<<4),
    AC_TIM_CR2_MMS_COMP_OC1REF_gc           = (0x04<<4),
    AC_TIM_CR2_MMS_COMP_OC2REF_gc           = (0x05<<4),
    AC_TIM_CR2_MMS_COMP_OC3REF_gc           = (0x06<<4),
    AC_TIM_CR2_MMS_COMP_OC4REF_gc           = (0x07<<4),
    AC_TIM_CR2_CCDS_CCX_gc                  = (0x00<<3),
    AC_TIM_CR2_CCDS_UPDATE_gc               = (0x01<<3),
    AC_TIM_CR2_CCUS_COMG_gc                 = (0x00<<2),
    AC_TIM_CR2_CCUS_COMG_OR_TRGI_gc         = (0x01<<2),
    AC_TIM_CR2_CCPC_NOPRELOAD_gc            = (0x00<<0),
    AC_TIM_CR2_CCPC_PRELOAD_gc              = (0x01<<0)
} AC_TIM_CR2_t;

#define AC_TIM_CR2_MMS2_bm          (0x15<<20)
#define AC_TIM_CR2_OIS6_bm          (0x01<<18)
#define AC_TIM_CR2_OIS5_bm          (0x01<<16)
#define AC_TIM_CR2_OIS4_bm          (0x01<<14)
#define AC_TIM_CR2_OIS3N_bm         (0x01<<13)
#define AC_TIM_CR2_OIS3_bm          (0x01<<12)
#define AC_TIM_CR2_OIS2N_bm         (0x01<<11)
#define AC_TIM_CR2_OIS2_bm          (0x01<<10)
#define AC_TIM_CR2_OIS1_bm          (0x01<<9)
#define AC_TIM_CR2_TI1S_bm          (0x01<<7)
#define AC_TIM_CR2_MMS_bm           (0x07<<4)
#define AC_TIM_CR2_CCDS_bm          (0x01<<3)
#define AC_TIM_CR2_CCUS_bm          (0x01<<2)
#define AC_TIM_CR2_CCPC_bm          (0x01<<0)

