Hyvok/ARM-induction-heater-controller/src/stm32f30x_new.h
#define AC_TIM_SMCR_SMS_bm          (0x10007)
#define AC_TIM_SMCR_ETP_bm          (0x01<<15)
#define AC_TIM_SMCR_ECE_bm          (0x01<<14)
#define AC_TIM_SMCR_ETPS_bm         (0x03<<12)
#define AC_TIM_SMCR_ETF_bm          (0x0F<<8)
#define AC_TIM_SMCR_MSM_bm          (0x01<<7)
#define AC_TIM_SMCR_TS_bm           (0x07<<4)
#define AC_TIM_SMCR_OCCS_bm         (0x01<<3)
#define AC_TIM_SMCR_SMS_bm          (0x07<<0)

struct enum
{
    AC_TIM_CCMR1_OC2M_FROZEN_gc         = (0x00<<12),
    AC_TIM_CCMR1_OC2M_CH1_ACT_gc        = (0x01<<12),
    AC_TIM_CCMR1_OC2M_CH1_INACT_gc      = (0x02<<12),
    AC_TIM_CCMR1_OC2M_TOGGLE_gc         = (0x03<<12),
    AC_TIM_CCMR1_OC2M_FINACTIVE_gc      = (0x04<<12),
    AC_TIM_CCMR1_OC2M_FACTIVE_gc        = (0x05<<12),
    AC_TIM_CCMR1_OC2M_PWMM1_gc          = (0x06<<12),
    AC_TIM_CCMR1_OC2M_PWMM2_gc          = (0x07<<12),
    AC_TIM_CCMR1_OC2M_OPMM1_gc          = ((0x01<<24)|((0x00<<12))),
    AC_TIM_CCMR1_OC2M_OPMM2_gc          = ((0x01<<24)|((0x01<<12))),
    AC_TIM_CCMR1_OC2M_CPWMM1_gc         = ((0x01<<24)|((0x04<<12))),
    AC_TIM_CCMR1_OC2M_CPWMM2_gc         = ((0x01<<24)|((0x05<<12))),
    AC_TIM_CCMR1_OC2M_APWMM1_gc         = ((0x01<<24)|((0x06<<12))),
    AC_TIM_CCMR1_OC1M_FROZEN_gc         = (0x00<<4),
    AC_TIM_CCMR1_OC1M_CH1_ACT_gc        = (0x01<<4),
    AC_TIM_CCMR1_OC1M_CH1_INACT_gc      = (0x02<<4),
    AC_TIM_CCMR1_OC1M_TOGGLE_gc         = (0x03<<4),
    AC_TIM_CCMR1_OC1M_FINACTIVE_gc      = (0x04<<4),
    AC_TIM_CCMR1_OC1M_FACTIVE_gc        = (0x05<<4),
    AC_TIM_CCMR1_OC1M_PWMM1_gc          = (0x06<<4),
    AC_TIM_CCMR1_OC1M_PWMM2_gc          = (0x07<<4),
    AC_TIM_CCMR1_OC1M_OPMM1_gc          = ((0x01<<16)|((0x00<<4))),
    AC_TIM_CCMR1_OC1M_OPMM2_gc          = ((0x01<<16)|((0x01<<4))),
    AC_TIM_CCMR1_OC1M_CPWMM1_gc         = ((0x01<<16)|((0x04<<4))),
    AC_TIM_CCMR1_OC1M_CPWMM2_gc         = ((0x01<<16)|((0x05<<4))),
    AC_TIM_CCMR1_OC1M_APWMM1_gc         = ((0x01<<16)|((0x06<<4))),
    AC_TIM_CCMR1_OC1M_APWMM2_gc         = ((0x01<<16)|((0x07<<4))),
    AC_TIM_CCMR1_OC1M_APWMM2_gc         = ((0x01<<16)|((0x07<<4))),
    AC_TIM_CCMR1_IC2F_NONE_gc           = (0x00<<12),
    AC_TIM_CCMR1_IC2F_DIV1N2_gc         = (0x01<<12),
    AC_TIM_CCMR1_IC2F_DIV1N4_gc         = (0x02<<12),
    AC_TIM_CCMR1_IC2F_DIV1N8_gc         = (0x03<<12),
    AC_TIM_CCMR1_IC2F_DIV2N6_gc         = (0x04<<12),
    AC_TIM_CCMR1_IC2F_DIV2N8_gc         = (0x05<<12),
    AC_TIM_CCMR1_IC2F_DIV4N6_gc         = (0x06<<12),
    AC_TIM_CCMR1_IC2F_DIV4N8_gc         = (0x07<<12),
    AC_TIM_CCMR1_IC2F_DIV8N6_gc         = (0x08<<12),
    AC_TIM_CCMR1_IC2F_DIV8N8_gc         = (0x09<<12),
    AC_TIM_CCMR1_IC2F_DIV16N5_gc        = (0x0A<<12),
    AC_TIM_CCMR1_IC2F_DIV16N6_gc        = (0x0B<<12),
    AC_TIM_CCMR1_IC2F_DIV16N8_gc        = (0x0C<<12),
    AC_TIM_CCMR1_IC2F_DIV32N5_gc        = (0x0D<<12),
    AC_TIM_CCMR1_IC2F_DIV32N6_gc        = (0x0E<<12),
    AC_TIM_CCMR1_IC2F_DIV32N8_gc        = (0x0F<<12),
    AC_TIM_CCMR1_IC1F_NONE_gc           = (0x00<<4),
    AC_TIM_CCMR1_IC1F_DIV1N2_gc         = (0x01<<4),
    AC_TIM_CCMR1_IC1F_DIV1N4_gc         = (0x02<<4),
    AC_TIM_CCMR1_IC1F_DIV1N8_gc         = (0x03<<4),
    AC_TIM_CCMR1_IC1F_DIV2N6_gc         = (0x04<<4),
    AC_TIM_CCMR1_IC1F_DIV2N8_gc         = (0x05<<4),
    AC_TIM_CCMR1_IC1F_DIV4N6_gc         = (0x06<<4),
    AC_TIM_CCMR1_IC1F_DIV4N8_gc         = (0x07<<4),
    AC_TIM_CCMR1_IC1F_DIV8N6_gc         = (0x08<<4),
    AC_TIM_CCMR1_IC1F_DIV8N8_gc         = (0x09<<4),
    AC_TIM_CCMR1_IC1F_DIV16N5_gc        = (0x0A<<4),
    AC_TIM_CCMR1_IC1F_DIV16N6_gc        = (0x0B<<4),
    AC_TIM_CCMR1_IC1F_DIV16N8_gc        = (0x0C<<4),
    AC_TIM_CCMR1_IC1F_DIV32N5_gc        = (0x0D<<4),
    AC_TIM_CCMR1_IC1F_DIV32N6_gc        = (0x0E<<4),
    AC_TIM_CCMR1_IC1F_DIV32N8_gc        = (0x0F<<4),
    AC_TIM_CCMR1_IC2PSC_NONE_gc         = (0x00<<10),
    AC_TIM_CCMR1_IC2PSC_N2_gc           = (0x01<<10),
    AC_TIM_CCMR1_IC2PSC_N4_gc           = (0x02<<10),
    AC_TIM_CCMR1_IC2PSC_N8_gc           = (0x03<<10),
    AC_TIM_CCMR1_IC1PSC_NONE_gc         = (0x00<<2),
    AC_TIM_CCMR1_IC1PSC_N2_gc           = (0x01<<2),
    AC_TIM_CCMR1_IC1PSC_N4_gc           = (0x02<<2),
    AC_TIM_CCMR1_IC1PSC_N8_gc           = (0x03<<2),
    AC_TIM_CCMR1_CC2S_OUT_gc            = (0x00<<8),
    AC_TIM_CCMR1_CC2S_INTI2_gc          = (0x01<<8),
    AC_TIM_CCMR1_CC2S_INTI1_gc          = (0x02<<8),
    AC_TIM_CCMR1_CC2S_INTRC_gc          = (0x03<<8),
    AC_TIM_CCMR1_CC1S_OUT_gc            = (0x00<<0),
    AC_TIM_CCMR1_CC1S_INTI2_gc          = (0x01<<0),
    AC_TIM_CCMR1_CC1S_INTI1_gc          = (0x02<<0),
    AC_TIM_CCMR1_CC1S_INTRC_gc          = (0x03<<0),
    AC_TIM_CCMR1_OC2CE_DIS_gc           = (0x00<<15),
    AC_TIM_CCMR1_OC2CE_EN_gc            = (0x01<<15),
    AC_TIM_CCMR1_OC2PE_DIS_gc           = (0x00<<11),
    AC_TIM_CCMR1_OC2PE_EN_gc            = (0x01<<11),
    AC_TIM_CCMR1_OC2FE_NORM_gc          = (0x00<<10),
    AC_TIM_CCMR1_OC2FE_FAST_gc          = (0x01<<10),
    AC_TIM_CCMR1_OC1CE_DIS_gc           = (0x00<<7),
    AC_TIM_CCMR1_OC1CE_EN_gc            = (0x01<<7),
    AC_TIM_CCMR1_OC1PE_DIS_gc           = (0x00<<3),
    AC_TIM_CCMR1_OC1PE_EN_gc            = (0x01<<3),
    AC_TIM_CCMR1_OC1FE_NORM_gc          = (0x00<<2),
    AC_TIM_CCMR1_OC1FE_FAST_gc          = (0x01<<2),
} AC_TIM_CCMR1_t;

#define AC_TIM_CCMR1_OC2M_bm        (0x807000)
#define AC_TIM_CCMR1_OC1M_bm        (0x10070)
#define AC_TIM_CCMR1_IC2F_bm        (0x0F<<12)
#define AC_TIM_CCMR1_IC2PSC_bm      (0x03<<10)
#define AC_TIM_CCMR1_OC2CE_bm       (0x01<<15)
#define AC_TIM_CCMR1_OC2PE_bm       (0x01<<11)
#define AC_TIM_CCMR1_OC2FE_bm       (0x01<<10)
#define AC_TIM_CCMR1_CC2S_bm        (0x03<<8)
#define AC_TIM_CCMR1_IC1F_bm        (0x0F<<4)
#define AC_TIM_CCMR1_IC1PSC_bm      (0x03<<2)
#define AC_TIM_CCMR1_OC1CE_bm       (0x01<<7)
#define AC_TIM_CCMR1_OC1PE_bm       (0x01<<3)
#define AC_TIM_CCMR1_OC1FE_bm       (0x01<<2)
#define AC_TIM_CCMR1_CC1S_bm        (0x03<<0)

struct enum
{
    AC_TIM_CCMR2_OC4M_FROZEN_gc         = (0x00<<12),
    AC_TIM_CCMR2_OC4M_CH1_ACT_gc        = (0x01<<12),
    AC_TIM_CCMR2_OC4M_CH1_INACT_gc      = (0x02<<12),
    AC_TIM_CCMR2_OC4M_TOGGLE_gc         = (0x03<<12),
    AC_TIM_CCMR2_OC4M_FINACTIVE_gc      = (0x04<<12),
    AC_TIM_CCMR2_OC4M_FACTIVE_gc        = (0x05<<12),
    AC_TIM_CCMR2_OC4M_PWMM1_gc          = (0x06<<12),
    AC_TIM_CCMR2_OC4M_PWMM2_gc          = (0x07<<12),
    AC_TIM_CCMR2_OC4M_OPMM1_gc          = ((0x01<<24)|((0x00<<12))),
    AC_TIM_CCMR2_OC4M_OPMM2_gc          = ((0x01<<24)|((0x01<<12))),
    AC_TIM_CCMR2_OC4M_CPWMM1_gc         = ((0x01<<24)|((0x04<<12))),
    AC_TIM_CCMR2_OC4M_CPWMM2_gc         = ((0x01<<24)|((0x05<<12))),
    AC_TIM_CCMR2_OC4M_APWMM1_gc         = ((0x01<<24)|((0x06<<12))),
    AC_TIM_CCMR2_OC3M_FROZEN_gc         = (0x00<<4),
    AC_TIM_CCMR2_OC3M_CH1_ACT_gc        = (0x01<<4),
    AC_TIM_CCMR2_OC3M_CH1_INACT_gc      = (0x02<<4),
    AC_TIM_CCMR2_OC3M_TOGGLE_gc         = (0x03<<4),
    AC_TIM_CCMR2_OC3M_FINACTIVE_gc      = (0x04<<4),
    AC_TIM_CCMR2_OC3M_FACTIVE_gc        = (0x05<<4),
    AC_TIM_CCMR2_OC3M_PWMM1_gc          = (0x06<<4),
    AC_TIM_CCMR2_OC3M_PWMM2_gc          = (0x07<<4),
    AC_TIM_CCMR2_OC3M_OPMM1_gc          = ((0x01<<16)|((0x00<<4))),
    AC_TIM_CCMR2_OC3M_OPMM2_gc          = ((0x01<<16)|((0x01<<4))),
    AC_TIM_CCMR2_OC3M_CPWMM1_gc         = ((0x01<<16)|((0x04<<4))),
    AC_TIM_CCMR2_OC3M_CPWMM2_gc         = ((0x01<<16)|((0x05<<4))),
    AC_TIM_CCMR2_OC3M_APWMM1_gc         = ((0x01<<16)|((0x06<<4))),
    AC_TIM_CCMR2_OC3M_APWMM2_gc         = ((0x01<<16)|((0x07<<4))),
    AC_TIM_CCMR2_OC3M_APWMM2_gc         = ((0x01<<16)|((0x07<<4))),
    AC_TIM_CCMR2_IC4F_NONE_gc           = (0x00<<12),
    AC_TIM_CCMR2_IC4F_DIV1N2_gc         = (0x01<<12),
    AC_TIM_CCMR2_IC4F_DIV1N4_gc         = (0x02<<12),
    AC_TIM_CCMR2_IC4F_DIV1N8_gc         = (0x03<<12),
    AC_TIM_CCMR2_IC4F_DIV2N6_gc         = (0x04<<12),
    AC_TIM_CCMR2_IC4F_DIV2N8_gc         = (0x05<<12),
    AC_TIM_CCMR2_IC4F_DIV4N6_gc         = (0x06<<12),
    AC_TIM_CCMR2_IC4F_DIV4N8_gc         = (0x07<<12),
    AC_TIM_CCMR2_IC4F_DIV8N6_gc         = (0x08<<12),
    AC_TIM_CCMR2_IC4F_DIV8N8_gc         = (0x09<<12),
    AC_TIM_CCMR2_IC4F_DIV16N5_gc        = (0x0A<<12),
    AC_TIM_CCMR2_IC4F_DIV16N6_gc        = (0x0B<<12),
    AC_TIM_CCMR2_IC4F_DIV16N8_gc        = (0x0C<<12),
    AC_TIM_CCMR2_IC4F_DIV32N5_gc        = (0x0D<<12),
    AC_TIM_CCMR2_IC4F_DIV32N6_gc        = (0x0E<<12),
    AC_TIM_CCMR2_IC4F_DIV32N8_gc        = (0x0F<<12),
    AC_TIM_CCMR2_IC3F_NONE_gc           = (0x00<<4),
    AC_TIM_CCMR2_IC3F_DIV1N2_gc         = (0x01<<4),
    AC_TIM_CCMR2_IC3F_DIV1N4_gc         = (0x02<<4),
    AC_TIM_CCMR2_IC3F_DIV1N8_gc         = (0x03<<4),
    AC_TIM_CCMR2_IC3F_DIV2N6_gc         = (0x04<<4),
    AC_TIM_CCMR2_IC3F_DIV2N8_gc         = (0x05<<4),
    AC_TIM_CCMR2_IC3F_DIV4N6_gc         = (0x06<<4),
    AC_TIM_CCMR2_IC3F_DIV4N8_gc         = (0x07<<4),
    AC_TIM_CCMR2_IC3F_DIV8N6_gc         = (0x08<<4),
    AC_TIM_CCMR2_IC3F_DIV8N8_gc         = (0x09<<4),
    AC_TIM_CCMR2_IC3F_DIV16N5_gc        = (0x0A<<4),
    AC_TIM_CCMR2_IC3F_DIV16N6_gc        = (0x0B<<4),
    AC_TIM_CCMR2_IC3F_DIV16N8_gc        = (0x0C<<4),
    AC_TIM_CCMR2_IC3F_DIV32N5_gc        = (0x0D<<4),
    AC_TIM_CCMR2_IC3F_DIV32N6_gc        = (0x0E<<4),
    AC_TIM_CCMR2_IC3F_DIV32N8_gc        = (0x0F<<4),
    AC_TIM_CCMR2_IC4PSC_NONE_gc         = (0x00<<10),
    AC_TIM_CCMR2_IC4PSC_N2_gc           = (0x01<<10),
    AC_TIM_CCMR2_IC4PSC_N4_gc           = (0x02<<10),
    AC_TIM_CCMR2_IC4PSC_N8_gc           = (0x03<<10),
    AC_TIM_CCMR2_IC3PSC_NONE_gc         = (0x00<<2),
    AC_TIM_CCMR2_IC3PSC_N2_gc           = (0x01<<2),
    AC_TIM_CCMR2_IC3PSC_N4_gc           = (0x02<<2),
    AC_TIM_CCMR2_IC3PSC_N8_gc           = (0x03<<2),
    AC_TIM_CCMR2_CC4S_OUT_gc            = (0x00<<8),
    AC_TIM_CCMR2_CC4S_INTI2_gc          = (0x01<<8),
    AC_TIM_CCMR2_CC4S_INTI1_gc          = (0x02<<8),
    AC_TIM_CCMR2_CC4S_INTRC_gc          = (0x03<<8),
    AC_TIM_CCMR2_CC3S_OUT_gc            = (0x00<<0),
    AC_TIM_CCMR2_CC3S_INTI2_gc          = (0x01<<0),
    AC_TIM_CCMR2_CC3S_INTI1_gc          = (0x02<<0),
    AC_TIM_CCMR2_CC3S_INTRC_gc          = (0x03<<0),
    AC_TIM_CCMR2_OC4CE_DIS_gc           = (0x00<<15),
    AC_TIM_CCMR2_OC4CE_EN_gc            = (0x01<<15),
    AC_TIM_CCMR2_OC4PE_DIS_gc           = (0x00<<11),
    AC_TIM_CCMR2_OC4PE_EN_gc            = (0x01<<11),
    AC_TIM_CCMR2_OC4FE_NORM_gc          = (0x00<<10),
    AC_TIM_CCMR2_OC4FE_FAST_gc          = (0x01<<10),
    AC_TIM_CCMR2_OC3CE_DIS_gc           = (0x00<<7),
    AC_TIM_CCMR2_OC3CE_EN_gc            = (0x01<<7),
    AC_TIM_CCMR2_OC3PE_DIS_gc           = (0x00<<3),
    AC_TIM_CCMR2_OC3PE_EN_gc            = (0x01<<3),
    AC_TIM_CCMR2_OC3FE_NORM_gc          = (0x00<<2),
    AC_TIM_CCMR2_OC3FE_FAST_gc          = (0x01<<2),
} AC_TIM_CCMR2_t;

#define AC_TIM_CCMR2_OC4M_bm        (0x807000)
#define AC_TIM_CCMR2_OC3M_bm        (0x10070)
#define AC_TIM_CCMR2_IC4F_bm        (0x0F<<12)
#define AC_TIM_CCMR2_IC4PSC_bm      (0x03<<10)
#define AC_TIM_CCMR2_OC4CE_bm       (0x01<<15)
#define AC_TIM_CCMR2_OC4PE_bm       (0x01<<11)
#define AC_TIM_CCMR2_OC4FE_bm       (0x01<<10)
#define AC_TIM_CCMR2_CC4S_bm        (0x03<<8)
#define AC_TIM_CCMR2_IC3F_bm        (0x0F<<4)
#define AC_TIM_CCMR2_IC3PSC_bm      (0x03<<2)
#define AC_TIM_CCMR2_OC3CE_bm       (0x01<<7)
#define AC_TIM_CCMR2_OC3PE_bm       (0x01<<3)
#define AC_TIM_CCMR2_OC3FE_bm       (0x01<<2)
#define AC_TIM_CCMR2_CC3S_bm        (0x03<<0)

struct enum
{
    AC_TIM_CCER_CC1E_DIS_gc         = (0x00<<0),
    AC_TIM_CCER_CC1E_EN_gc          = (0x01<<0),
    AC_TIM_CCER_CC2E_DIS_gc         = (0x00<<4),
    AC_TIM_CCER_CC2E_EN_gc          = (0x01<<4),
    AC_TIM_CCER_CC3E_DIS_gc         = (0x00<<8),
    AC_TIM_CCER_CC3E_EN_gc          = (0x01<<8),
    AC_TIM_CCER_CC4E_DIS_gc         = (0x00<<12),
    AC_TIM_CCER_CC4E_EN_gc          = (0x01<<12),
    AC_TIM_CCER_CC5E_DIS_gc         = (0x00<<16),
    AC_TIM_CCER_CC5E_EN_gc          = (0x01<<16),
    AC_TIM_CCER_CC6E_DIS_gc         = (0x00<<20),
    AC_TIM_CCER_CC6E_EN_gc          = (0x01<<20),
    AC_TIM_CCER_CC1P_ACTHI_gc       = (0x00<<1),
    AC_TIM_CCER_CC1P_ACTLO_gc       = (0x01<<1),
    AC_TIM_CCER_CC2P_ACTHI_gc       = (0x00<<5),
    AC_TIM_CCER_CC2P_ACTLO_gc       = (0x01<<5),
    AC_TIM_CCER_CC3P_ACTHI_gc       = (0x00<<9),
    AC_TIM_CCER_CC3P_ACTLO_gc       = (0x01<<9),
    AC_TIM_CCER_CC4P_ACTHI_gc       = (0x00<<13),
    AC_TIM_CCER_CC4P_ACTLO_gc       = (0x01<<13),
    AC_TIM_CCER_CC5P_ACTHI_gc       = (0x00<<17),
    AC_TIM_CCER_CC5P_ACTLO_gc       = (0x01<<17),
    AC_TIM_CCER_CC6P_ACTHI_gc       = (0x00<<21),
    AC_TIM_CCER_CC6P_ACTLO_gc       = (0x01<<21),
    AC_TIM_CCER_CC1NE_DIS_gc        = (0x00<<2),
    AC_TIM_CCER_CC1NE_EN_gc         = (0x01<<2),
    AC_TIM_CCER_CC2NE_DIS_gc        = (0x00<<6),
    AC_TIM_CCER_CC2NE_EN_gc         = (0x01<<6),
    AC_TIM_CCER_CC3NE_DIS_gc        = (0x00<<10),
    AC_TIM_CCER_CC3NE_EN_gc         = (0x01<<10),
    AC_TIM_CCER_CC1NP_ACTHI_gc      = (0x00<<3),
    AC_TIM_CCER_CC1NP_ACTLO_gc      = (0x01<<3),
    AC_TIM_CCER_CC2NP_ACTHI_gc      = (0x00<<7),
    AC_TIM_CCER_CC2NP_ACTLO_gc      = (0x01<<7),
    AC_TIM_CCER_CC3NP_ACTHI_gc      = (0x00<<11),
    AC_TIM_CCER_CC3NP_ACTLO_gc      = (0x01<<11),
    AC_TIM_CCER_CC4NP_ACTHI_gc      = (0x00<<15),
    AC_TIM_CCER_CC4NP_ACTLO_gc      = (0x01<<15),
    AC_TIM_CCER_CC1IN_RIS_gc        = (0x00<<1),
    AC_TIM_CCER_CC1IN_FALL_gc       = (0x01<<1),
    AC_TIM_CCER_CC1IN_BOTH_gc       = (0x05<<1),
    AC_TIM_CCER_CC2IN_RIS_gc        = (0x00<<5),
    AC_TIM_CCER_CC2IN_FALL_gc       = (0x01<<5),
    AC_TIM_CCER_CC2IN_BOTH_gc       = (0x05<<5),
    AC_TIM_CCER_CC3IN_RIS_gc        = (0x00<<9),
    AC_TIM_CCER_CC3IN_FALL_gc       = (0x01<<9),
    AC_TIM_CCER_CC3IN_BOTH_gc       = (0x05<<9),
    AC_TIM_CCER_CC4IN_RIS_gc        = (0x00<<13),
    AC_TIM_CCER_CC4IN_FALL_gc       = (0x01<<13),
    AC_TIM_CCER_CC4IN_BOTH_gc       = (0x05<<13),
} AC_TIM_CCER_t;

#define AC_TIM_CCER_CC6P_bm         (0x01<<21)
#define AC_TIM_CCER_CC6E_bm         (0x01<<20)
#define AC_TIM_CCER_CC5P_bm         (0x01<<17)
#define AC_TIM_CCER_CC5E_bm         (0x01<<16)
#define AC_TIM_CCER_CC4NP_bm        (0x01<<15)
#define AC_TIM_CCER_CC4P_bm         (0x01<<13)
#define AC_TIM_CCER_CC4E_bm         (0x01<<12)
#define AC_TIM_CCER_CC3NP_bm        (0x01<<11)
#define AC_TIM_CCER_CC3NE_bm        (0x01<<10)
#define AC_TIM_CCER_CC3P_bm         (0x01<<9)
#define AC_TIM_CCER_CC3E_bm         (0x01<<8)
#define AC_TIM_CCER_CC2NP_bm        (0x01<<7)
#define AC_TIM_CCER_CC2NE_bm        (0x01<<6)
#define AC_TIM_CCER_CC2P_bm         (0x01<<5)
#define AC_TIM_CCER_CC2E_bm         (0x01<<4)
#define AC_TIM_CCER_CC1NP_bm        (0x01<<3)
#define AC_TIM_CCER_CC1NE_bm        (0x01<<2)
#define AC_TIM_CCER_CC1P_bm         (0x01<<1)
#define AC_TIM_CCER_CC1E_bm         (0x01<<0)
// Masks for CCxP and CCxNP pins when channel is configured as input
#define AC_TIM_CCER_CC1I_bm         (0x0A)
#define AC_TIM_CCER_CC2I_bm         (0xA0)
#define AC_TIM_CCER_CC3I_bm         (0xA000)

#define AC_TIM_CNT_CNT_bm           (0xFFFF<<0)
#define AC_TIM_CNT_UIFCPY_bm        (0x01<<31)

#define AC_TIM_PSC_PSC_bm           (0xFFFF<<0)

#define AC_TIM_ARR_ARR_bm           (0xFFFF<<0)

#define AC_TIM_RCR_REP_bm           (0xFFFF<<0)

#define AC_TIM_CCR1_CCR1_bm         (0xFFFF<<0)

#define AC_TIM_CCR2_CCR2_bm         (0xFFFF<<0)

#define AC_TIM_CCR3_CCR3_bm         (0xFFFF<<0)

