Hyvok/ARM-induction-heater-controller/src/stm32f30x_new.h
#define AC_TIM_CCR4_CCR4_bm         (0xFFFF<<0)

struct enum
{
    AC_TIM_CCR5_GC5C3_NONE_gc       = (0x00<<31),
    AC_TIM_CCR5_GC5C3_AND_gc        = (0x01<<31),
    AC_TIM_CCR5_GC5C2_NONE_gc       = (0x00<<30),
    AC_TIM_CCR5_GC5C2_AND_gc        = (0x01<<30),
    AC_TIM_CCR5_GC5C1_NONE_gc       = (0x00<<29),
    AC_TIM_CCR5_GC5C1_AND_gc        = (0x01<<29),
} AC_TIM_CCR5_t;

#define AC_TIM_CCR5_CCR5_bm         (0xFFFF<<0)
#define AC_TIM_CCR5_GC5C3_bm        (0x01<<31)
#define AC_TIM_CCR5_GC5C2_bm        (0x01<<30)
#define AC_TIM_CCR5_GC5C1_bm        (0x01<<29)

#define AC_TIM_CCR6_CCR6_bm         (0xFFFF<<0)
struct enum
{
    AC_TIM_BDTR_BK2P_ACTLO_gc       = (0x00<<25),
    AC_TIM_BDTR_BK2P_ACTHI_gc       = (0x01<<25),
    AC_TIM_BDTR_BK2E_DIS_gc         = (0x00<<24),
    AC_TIM_BDTR_BK2E_EN_gc          = (0x01<<24),
    AC_TIM_BDTR_BK2F_NONE_gc        = (0x00<<20),
    AC_TIM_BDTR_BK2F_DIVBY1N2_gc    = (0x01<<20),
    AC_TIM_BDTR_BK2F_DIVBY1N4_gc    = (0x02<<20),
    AC_TIM_BDTR_BK2F_DIVBY1N8_gc    = (0x03<<20),
    AC_TIM_BDTR_BK2F_DIVBY2N6_gc    = (0x04<<20),
    AC_TIM_BDTR_BK2F_DIVBY2N8_gc    = (0x05<<20),
    AC_TIM_BDTR_BK2F_DIVBY4N6_gc    = (0x06<<20),
    AC_TIM_BDTR_BK2F_DIVBY4N8_gc    = (0x07<<20),
    AC_TIM_BDTR_BK2F_DIVBY8N6_gc    = (0x08<<20),
    AC_TIM_BDTR_BK2F_DIVBY8N8_gc    = (0x09<<20),
    AC_TIM_BDTR_BK2F_DIVBY16N5_gc   = (0x0A<<20),
    AC_TIM_BDTR_BK2F_DIVBY16N6_gc   = (0x0B<<20),
    AC_TIM_BDTR_BK2F_DIVBY16N8_gc   = (0x0C<<20),
    AC_TIM_BDTR_BK2F_DIVBY32N5_gc   = (0x0D<<20),
    AC_TIM_BDTR_BK2F_DIVBY32N6_gc   = (0x0E<<20),
    AC_TIM_BDTR_BK2F_DIVBY32N8_gc   = (0x0F<<20),
    AC_TIM_BDTR_BKF_NONE_gc         = (0x00<<16),
    AC_TIM_BDTR_BKF_DIVBY1N2_gc     = (0x01<<16),
    AC_TIM_BDTR_BKF_DIVBY1N4_gc     = (0x02<<16),
    AC_TIM_BDTR_BKF_DIVBY1N8_gc     = (0x03<<16),
    AC_TIM_BDTR_BKF_DIVBY2N6_gc     = (0x04<<16),
    AC_TIM_BDTR_BKF_DIVBY2N8_gc     = (0x05<<16),
    AC_TIM_BDTR_BKF_DIVBY4N6_gc     = (0x06<<16),
    AC_TIM_BDTR_BKF_DIVBY4N8_gc     = (0x07<<16),
    AC_TIM_BDTR_BKF_DIVBY8N6_gc     = (0x08<<16),
    AC_TIM_BDTR_BKF_DIVBY8N8_gc     = (0x09<<16),
    AC_TIM_BDTR_BKF_DIVBY16N5_gc    = (0x0A<<16),
    AC_TIM_BDTR_BKF_DIVBY16N6_gc    = (0x0B<<16),
    AC_TIM_BDTR_BKF_DIVBY16N8_gc    = (0x0C<<16),
    AC_TIM_BDTR_BKF_DIVBY32N5_gc    = (0x0D<<16),
    AC_TIM_BDTR_BKF_DIVBY32N6_gc    = (0x0E<<16),
    AC_TIM_BDTR_BKF_DIVBY32N8_gc    = (0x0F<<16),
    AC_TIM_BDTR_MOE_DIS_gc          = (0x00<<15),
    AC_TIM_BDTR_MOE_EN_gc           = (0x01<<15),
    AC_TIM_BDTR_AOE_DIS_gc          = (0x00<<14),
    AC_TIM_BDTR_AOE_EN_gc           = (0x01<<14),
    AC_TIM_BDTR_BKP_ACTLO_gc        = (0x00<<13),
    AC_TIM_BDTR_BKP_ACTHI_gc        = (0x01<<13),
    AC_TIM_BDTR_BKE_DIS_gc          = (0x00<<12),
    AC_TIM_BDTR_BKE_EN_gc           = (0x01<<12),
    AC_TIM_BDTR_OSSR_DIS_gc         = (0x00<<11),
    AC_TIM_BDTR_OSSR_EN_gc          = (0x01<<11),
    AC_TIM_BDTR_OSSI_DIS_gc         = (0x00<<10),
    AC_TIM_BDTR_OSSI_EN_gc          = (0x01<<10),
    AC_TIM_BDTR_LOCK_OFF_gc         = (0x00<<8),
    AC_TIM_BDTR_LOCK_LVL1_gc        = (0x01<<8),
    AC_TIM_BDTR_LOCK_LVL2_gc        = (0x02<<8),
    AC_TIM_BDTR_LOCK_LVL3_gc        = (0x03<<8),
} AC_TIM_BDTR_t;

#define AC_TIM_BDTR_BK2P_bm         (0x01<<25)
#define AC_TIM_BDTR_BK2E_bm         (0x01<<24)
#define AC_TIM_BDTR_BK2F_bm         (0x0F<<20)
#define AC_TIM_BDTR_BKF_bm          (0x0F<<16)
#define AC_TIM_BDTR_MOE_bm          (0x01<<15)
#define AC_TIM_BDTR_AOE_bm          (0x01<<14)
#define AC_TIM_BDTR_BKP_bm          (0x01<<13)
#define AC_TIM_BDTR_BKE_bm          (0x01<<12)
#define AC_TIM_BDTR_OSSR_bm         (0x01<<11)
#define AC_TIM_BDTR_OSSI_bm         (0x01<<10)
#define AC_TIM_BDTR_LOCK_bm         (0x03<<8)
#define AC_TIM_BDTR_DTG_bm          (0xFF<<0)

struct enum
{
    AC_TIM_CCMR3_OC6M_FROZEN_gc         = (0x00<<12),
    AC_TIM_CCMR3_OC6M_CH1_ACT_gc        = (0x01<<12),
    AC_TIM_CCMR3_OC6M_CH1_INACT_gc      = (0x02<<12),
    AC_TIM_CCMR3_OC6M_TOGGLE_gc         = (0x03<<12),
    AC_TIM_CCMR3_OC6M_FINACTIVE_gc      = (0x04<<12),
    AC_TIM_CCMR3_OC6M_FACTIVE_gc        = (0x05<<12),
    AC_TIM_CCMR3_OC6M_PWMM1_gc          = (0x06<<12),
    AC_TIM_CCMR3_OC6M_PWMM2_gc          = (0x07<<12),
    AC_TIM_CCMR3_OC6M_OPMM1_gc          = ((0x01<<24)|((0x00<<12))),
    AC_TIM_CCMR3_OC6M_OPMM2_gc          = ((0x01<<24)|((0x01<<12))),
    AC_TIM_CCMR3_OC6M_CPWMM1_gc         = ((0x01<<24)|((0x04<<12))),
    AC_TIM_CCMR3_OC6M_CPWMM2_gc         = ((0x01<<24)|((0x05<<12))),
    AC_TIM_CCMR3_OC6M_APWMM1_gc         = ((0x01<<24)|((0x06<<12))),
    AC_TIM_CCMR3_OC5M_FROZEN_gc         = (0x00<<4),
    AC_TIM_CCMR3_OC5M_CH1_ACT_gc        = (0x01<<4),
    AC_TIM_CCMR3_OC5M_CH1_INACT_gc      = (0x02<<4),
    AC_TIM_CCMR3_OC5M_TOGGLE_gc         = (0x03<<4),
    AC_TIM_CCMR3_OC5M_FINACTIVE_gc      = (0x04<<4),
    AC_TIM_CCMR3_OC5M_FACTIVE_gc        = (0x05<<4),
    AC_TIM_CCMR3_OC5M_PWMM1_gc          = (0x06<<4),
    AC_TIM_CCMR3_OC5M_PWMM2_gc          = (0x07<<4),
    AC_TIM_CCMR3_OC5M_OPMM1_gc          = ((0x01<<16)|((0x00<<4))),
    AC_TIM_CCMR3_OC5M_OPMM2_gc          = ((0x01<<16)|((0x01<<4))),
    AC_TIM_CCMR3_OC5M_CPWMM1_gc         = ((0x01<<16)|((0x04<<4))),
    AC_TIM_CCMR3_OC5M_CPWMM2_gc         = ((0x01<<16)|((0x05<<4))),
    AC_TIM_CCMR3_OC5M_APWMM1_gc         = ((0x01<<16)|((0x06<<4))),
    AC_TIM_CCMR3_OC5M_APWMM2_gc         = ((0x01<<16)|((0x07<<4))),
    AC_TIM_CCMR3_OC5M_APWMM2_gc         = ((0x01<<16)|((0x07<<4))),
    AC_TIM_CCMR3_OC6CE_DIS_gc           = (0x00<<15),
    AC_TIM_CCMR3_OC6CE_EN_gc            = (0x01<<15),
    AC_TIM_CCMR3_OC6PE_DIS_gc           = (0x00<<11),
    AC_TIM_CCMR3_OC6PE_EN_gc            = (0x01<<11),
    AC_TIM_CCMR3_OC6FE_NORM_gc          = (0x00<<10),
    AC_TIM_CCMR3_OC6FE_FAST_gc          = (0x01<<10),
    AC_TIM_CCMR3_OC5CE_DIS_gc           = (0x00<<7),
    AC_TIM_CCMR3_OC5CE_EN_gc            = (0x01<<7),
    AC_TIM_CCMR3_OC5PE_DIS_gc           = (0x00<<3),
    AC_TIM_CCMR3_OC5PE_EN_gc            = (0x01<<3),
    AC_TIM_CCMR3_OC5FE_NORM_gc          = (0x00<<2),
    AC_TIM_CCMR3_OC5FE_FAST_gc          = (0x01<<2),
} AC_TIM_CCMR3_t;

#define AC_TIM_CCMR3_OC6M_bm        (0x807000)
#define AC_TIM_CCMR3_OC5M_bm        (0x10070)
#define AC_TIM_CCMR3_OC6CE_bm       (0x01<<15)
#define AC_TIM_CCMR3_OC6PE_bm       (0x01<<11)
#define AC_TIM_CCMR3_OC6FE_bm       (0x01<<10)
#define AC_TIM_CCMR3_OC5CE_bm       (0x01<<7)
#define AC_TIM_CCMR3_OC5PE_bm       (0x01<<3)
#define AC_TIM_CCMR3_OC5FE_bm       (0x01<<2)

typedef struct 
{
    register32_t MODER;                         // GPIO port mode register, 0x00 
    register16_t OTYPER;                        // GPIO port output type register, 0x04 
    register16_t reserved_0x06;                 // Reserved, 0x06 
    register32_t OSPEEDR;                       // GPIO port output speed register, 0x08 
    register32_t PUPDR;                         // GPIO port pull-up/pull-down register, 0x0C 
    register16_t IDR;                           // GPIO port input data register, 0x10 
    register16_t reserved_0x12;                 // Reserved, 0x12 
    register16_t ODR;                           // GPIO port §output data register, 0x14 
    register16_t reserved_0x16;                 // Reserved, 0x16 
    register32_t BSRR;                          // GPIO port bit set/reset register, 0x18 
    register32_t LCKR;                          // GPIO port configuration lock register, 0x1C 
    register32_t AFRL;                          // GPIO alternate function low register, 0x20-0x24 
    register32_t AFRH;                          // GPIO alternate function low register, 0x20-0x24 
    register16_t BRR;                           // GPIO bit reset register, 0x28 
    register16_t reserved_0x2A;                 // Reserved, 0x2A 
} GPIO_t;

// GPIO bitfields
// IDR
#define GPIO_IDR_IDR0_bm            (0x01<<0)
#define GPIO_IDR_IDR1_bm            (0x01<<1)
#define GPIO_IDR_IDR2_bm            (0x01<<2)
#define GPIO_IDR_IDR3_bm            (0x01<<3)
#define GPIO_IDR_IDR4_bm            (0x01<<4)
#define GPIO_IDR_IDR5_bm            (0x01<<5)
#define GPIO_IDR_IDR6_bm            (0x01<<6)
#define GPIO_IDR_IDR7_bm            (0x01<<7)
#define GPIO_IDR_IDR8_bm            (0x01<<8)
#define GPIO_IDR_IDR9_bm            (0x01<<9)
#define GPIO_IDR_IDR10_bm           (0x01<<10)
#define GPIO_IDR_IDR11_bm           (0x01<<11)
#define GPIO_IDR_IDR12_bm           (0x01<<12)
#define GPIO_IDR_IDR13_bm           (0x01<<13)
#define GPIO_IDR_IDR14_bm           (0x01<<14)
#define GPIO_IDR_IDR15_bm           (0x01<<15)

// ODR
#define GPIO_ODR_ODR0_bm            (0x01<<0)
#define GPIO_ODR_ODR1_bm            (0x01<<1)
#define GPIO_ODR_ODR2_bm            (0x01<<2)
#define GPIO_ODR_ODR3_bm            (0x01<<3)
#define GPIO_ODR_ODR4_bm            (0x01<<4)
#define GPIO_ODR_ODR5_bm            (0x01<<5)
#define GPIO_ODR_ODR6_bm            (0x01<<6)
#define GPIO_ODR_ODR7_bm            (0x01<<7)
#define GPIO_ODR_ODR8_bm            (0x01<<8)
#define GPIO_ODR_ODR9_bm            (0x01<<9)
#define GPIO_ODR_ODR10_bm           (0x01<<10)
#define GPIO_ODR_ODR11_bm           (0x01<<11)
#define GPIO_ODR_ODR12_bm           (0x01<<12)
#define GPIO_ODR_ODR13_bm           (0x01<<13)
#define GPIO_ODR_ODR14_bm           (0x01<<14)
#define GPIO_ODR_ODR15_bm           (0x01<<15)

// BSRR
// BRy
#define GPIO_BSRR_BR0_bm            ((0x01<<0)<<16)
#define GPIO_BSRR_BR1_bm            ((0x01<<1)<<16)
#define GPIO_BSRR_BR2_bm            ((0x01<<2)<<16)
#define GPIO_BSRR_BR3_bm            ((0x01<<3)<<16)
#define GPIO_BSRR_BR4_bm            ((0x01<<4)<<16)
#define GPIO_BSRR_BR5_bm            ((0x01<<5)<<16)
#define GPIO_BSRR_BR6_bm            ((0x01<<6)<<16)
#define GPIO_BSRR_BR7_bm            ((0x01<<7)<<16)
#define GPIO_BSRR_BR8_bm            ((0x01<<8)<<16)
#define GPIO_BSRR_BR9_bm            ((0x01<<9)<<16)
#define GPIO_BSRR_BR10_bm           ((0x01<<10)<<16)
#define GPIO_BSRR_BR11_bm           ((0x01<<11)<<16)
#define GPIO_BSRR_BR12_bm           ((0x01<<12)<<16)
#define GPIO_BSRR_BR13_bm           ((0x01<<13)<<16)
#define GPIO_BSRR_BR14_bm           ((0x01<<14)<<16)
#define GPIO_BSRR_BR15_bm           ((0x01<<15)<<16)

// BSy
#define GPIO_BSRR_BS0_bm            (0x01<<0)
#define GPIO_BSRR_BS1_bm            (0x01<<1)
#define GPIO_BSRR_BS2_bm            (0x01<<2)
#define GPIO_BSRR_BS3_bm            (0x01<<3)
#define GPIO_BSRR_BS4_bm            (0x01<<4)
#define GPIO_BSRR_BS5_bm            (0x01<<5)
#define GPIO_BSRR_BS6_bm            (0x01<<6)
#define GPIO_BSRR_BS7_bm            (0x01<<7)
#define GPIO_BSRR_BS8_bm            (0x01<<8)
#define GPIO_BSRR_BS9_bm            (0x01<<9)
#define GPIO_BSRR_BS10_bm           (0x01<<10)
#define GPIO_BSRR_BS11_bm           (0x01<<11)
#define GPIO_BSRR_BS12_bm           (0x01<<12)
#define GPIO_BSRR_BS13_bm           (0x01<<13)
#define GPIO_BSRR_BS14_bm           (0x01<<14)
#define GPIO_BSRR_BS15_bm           (0x01<<15)

typedef struct 
{
    register32_t CR;         // RCC clock control register,                                  Address offset: 0x00 
    register32_t CFGR;       // RCC clock configuration register,                            Address offset: 0x04 
    register32_t CIR;        // RCC clock interrupt register,                                Address offset: 0x08 
    register32_t APB2RSTR;   // RCC APB2 peripheral reset register,                          Address offset: 0x0C 
    register32_t APB1RSTR;   // RCC APB1 peripheral reset register,                          Address offset: 0x10 
    register32_t AHBENR;     // RCC AHB peripheral clock register,                           Address offset: 0x14 
    register32_t APB2ENR;    // RCC APB2 peripheral clock enable register,                   Address offset: 0x18 
    register32_t APB1ENR;    // RCC APB1 peripheral clock enable register,                   Address offset: 0x1C 
    register32_t BDCR;       // RCC Backup domain control register,                          Address offset: 0x20 
    register32_t CSR;        // RCC clock control & status register,                         Address offset: 0x24 
    register32_t AHBRSTR;    // RCC AHB peripheral reset register,                           Address offset: 0x28 
    register32_t CFGR2;      // RCC clock configuration register 2,                          Address offset: 0x2C 
    register32_t CFGR3;      // RCC clock configuration register 3,                          Address offset: 0x30 
} RCC_t;

