Hyvok/ARM-induction-heater-controller/src/stm32f30x_new.h
typedef enum
{
    RCC_AHBENR_ADC34EN_gc           = (0x01<<29),        // ADC1/ ADC2 clock enable 
    RCC_AHBENR_ADC12EN_gc           = (0x01<<28),        // ADC1/ ADC2 clock enable 
    RCC_AHBENR_TSCEN_gc             = (0x01<<24),        // TS clock enable 
    RCC_AHBENR_IOPFEN_gc            = (0x01<<22),
    RCC_AHBENR_IOPEEN_gc            = (0x01<<21),
    RCC_AHBENR_IOPDEN_gc            = (0x01<<20),
    RCC_AHBENR_IOPCEN_gc            = (0x01<<19),
    RCC_AHBENR_IOPBEN_gc            = (0x01<<18),        // GPIOB clock enable 
    RCC_AHBENR_IOPAEN_gc            = (0x01<<17),        // GPIOA clock enable 
    RCC_AHBENR_CRCEN_gc             = (0x01<<6),        // CRC clock enable 
    RCC_AHBENR_FLITFEN_gc           = (0x01<<4),        // FLITF clock enable 
    RCC_AHBENR_SRAMEN_gc            = (0x01<<2),        // SRAM interface clock enable 
    RCC_AHBENR_DMA2EN_gc            = (0x01<<1)        // DMA2 clock enable 
} RCC_AHBENR_t;

typedef enum
{
    RCC_APB2ENR_TIM17EN_gc          = (0x01<<18),        // TIM17 clock enable 
    RCC_APB2ENR_TIM16EN_gc          = (0x01<<17),        // TIM16 clock enable 
    RCC_APB2ENR_TIM15EN_gc          = (0x01<<16),        // TIM16 clock enable 
    RCC_APB2ENR_USART1EN_gc         = (0x01<<14),        // USART1 clock enable 
    RCC_APB2ENR_TIM8EN_gc           = (0x01<<13),        // TIM8 clock enable 
    RCC_APB2ENR_SPI1EN_gc           = (0x01<<12),        // SPI1 clock enable 
    RCC_APB2ENR_TIM1EN_gc           = (0x01<<11),        // TIM1 clock enable 
    RCC_APB2ENR_SYSCFGEN_gc         = (0x01<<0)
} RCC_APB2ENR_t;

typedef enum
{
    RCC_APB1ENR_DAC1EN_gc           = (0x01<<29),        // DAC clock enable 
    RCC_APB1ENR_PWREN_gc            = (0x01<<28),        // PWR clock enable 
    RCC_APB1ENR_DAC2EN_gc           = (0x01<<26),        // DAC 2 clock enable 
    RCC_APB1ENR_CANEN_gc            = (0x01<<25),        // CAN clock enable 
    RCC_APB1ENR_USBEN_gc            = (0x01<<23),        // USB clock enable 
    RCC_APB1ENR_I2C2EN_gc           = (0x01<<22),        // I2C 2 clock enable 
    RCC_APB1ENR_I2C1EN_gc           = (0x01<<21),        // I2C 1 clock enable 
    RCC_APB1ENR_UART5EN_gc          = (0x01<<20),        // UART 5 clock enable 
    RCC_APB1ENR_UART4EN_gc          = (0x01<<19),        // UART 4 clock enable 
    RCC_APB1ENR_USART3EN_gc         = (0x01<<18),        // USART 3 clock enable 
    RCC_APB1ENR_USART2EN_gc         = (0x01<<17),        // USART 2 clock enable 
    RCC_APB1ENR_SPI3EN_gc           = (0x01<<15),        // SPI3 clock enable 
    RCC_APB1ENR_SPI2EN_gc           = (0x01<<14),        // SPI2 clock enable 
    RCC_APB1ENR_WWDGEN_gc           = (0x01<<11),        // Window Watchdog clock enable 
    RCC_APB1ENR_TIM7EN_gc           = (0x01<<5),        // Timer 7 clock enable 
    RCC_APB1ENR_TIM6EN_gc           = (0x01<<4),        // Timer 6 clock enable 
    RCC_APB1ENR_TIM4EN_gc           = (0x01<<2),        // Timer 4 clock enable 
    RCC_APB1ENR_TIM3EN_gc           = (0x01<<1),        // Timer 3 clock enable 
    RCC_APB1ENR_TIM2EN_gc           = (0x01<<0)        // Timer 2 clock enable 
} RCC_APB1ENR_t;

typedef enum
{
    RCC_CR_PLLRDY_LOCKED_gc         = (0x01<<25),
    RCC_CR_PLLRDY_UNLOCKED_gc       = (0x00<<25),
    RCC_CR_PLLON_ON_gc              = (0x01<<24),
    RCC_CR_PLLON_OFF_gc             = (0x00<<24),
    RCC_CR_CSSON_ON_gc              = (0x01<<19),
    RCC_CR_CSSON_OFF_gc             = (0x00<<19),
    RCC_CR_HSEBYP_BYPASS_gc         = (0x01<<18),
    RCC_CR_HSEBYP_NOBYPASS_gc       = (0x00<<18),
    RCC_CR_HSERDY_RDY_gc            = (0x01<<17),
    RCC_CR_HSERDY_NOTRDY_gc         = (0x00<<17),
    RCC_CR_HSEON_ON_gc              = (0x01<<16),
    RCC_CR_HSEON_OFF_gc             = (0x00<<16),
    RCC_CR_HSIRDY_RDY_gc            = (0x01<<1),
    RCC_CR_HSIRDY_NOTRDY_gc         = (0x00<<1),
    RCC_CR_HSION_ON_gc              = (0x01),
    RCC_CR_HSION_OFF_gc             = (0x00)
} RCC_CR_t;

// RCC_CR register bitfields
#define RCC_CR_PLLRDY_bm            (0x01<<25)
#define RCC_CR_PLLON_bm             (0x01<<24)
#define RCC_CR_CSSON_bm             (0x01<<19)
#define RCC_CR_HSEBYP_bm            (0x01<<18)
#define RCC_CR_HSERDY_bm            (0x01<<17)
#define RCC_CR_HSEON_bm             (0x01<<16)
#define RCC_CR_HSIRDY_bm            (0x01<<1)
#define RCC_CR_HSION_bm             (0x01<<0)
#define RCC_CR_HSICAL_bm            (0xFF<<8)
#define RCC_CR_HSITRIM_bm           (0x1F<<3)

typedef enum
{
    RCC_CFGR_PLLNODIV_NODIV_gc      = (0x01<<31),
    RCC_CFGR_PLLNODIV_DIVBY2_gc     = (0x00<<31),
    RCC_CFGR_MCOPRE_DIVBY1_gc       = (0x00<<29),
    RCC_CFGR_MCOPRE_DIVBY2_gc       = (0x01<<29),
    RCC_CFGR_MCOPRE_DIVBY4_gc       = (0x02<<29),
    RCC_CFGR_MCOPRE_DIVBY8_gc       = (0x03<<29),
    RCC_CFGR_MCOPRE_DIVBY16_gc      = (0x04<<29),
    RCC_CFGR_MCOPRE_DIVBY32_gc      = (0x05<<29),
    RCC_CFGR_MCOPRE_DIVBY64_gc      = (0x06<<29),
    RCC_CFGR_MCOPRE_DIVBY128_gc     = (0x07<<29),
    RCC_CFGR_MCO_DIS_gc             = (0x00<<24),
    RCC_CFGR_MCO_LSI_gc             = (0x02<<24),
    RCC_CFGR_MCO_LSE_gc             = (0x03<<24),
    RCC_CFGR_MCO_SYSCLK_gc          = (0x04<<24),
    RCC_CFGR_MCO_HSI_gc             = (0x05<<24),
    RCC_CFGR_MCO_HSE_gc             = (0x06<<24),
    RCC_CFGR_MCO_PLL_gc             = (0x07<<24),
    RCC_CFGR_I2SSRC_SYS_gc          = (0x00<<23),
    RCC_CFGR_I2SSRC_EXT_gc          = (0x01<<23),
    RCC_CFGR_USBPRE_DIV_gc          = (0x00<<22),
    RCC_CFGR_USBPRE_NODIV_gc        = (0x01<<22),
    RCC_CFGR_PLLMUL_2_gc            = (0x00<<18),
    RCC_CFGR_PLLMUL_3_gc            = (0x01<<18),
    RCC_CFGR_PLLMUL_4_gc            = (0x02<<18),
    RCC_CFGR_PLLMUL_5_gc            = (0x03<<18),
    RCC_CFGR_PLLMUL_6_gc            = (0x04<<18),
    RCC_CFGR_PLLMUL_7_gc            = (0x05<<18),
    RCC_CFGR_PLLMUL_8_gc            = (0x06<<18),
    RCC_CFGR_PLLMUL_9_gc            = (0x07<<18),
    RCC_CFGR_PLLMUL_10_gc           = (0x08<<18),
    RCC_CFGR_PLLMUL_11_gc           = (0x09<<18),
    RCC_CFGR_PLLMUL_12_gc           = (0x0A<<18),
    RCC_CFGR_PLLMUL_13_gc           = (0x0B<<18),
    RCC_CFGR_PLLMUL_14_gc           = (0x0C<<18),
    RCC_CFGR_PLLMUL_15_gc           = (0x0D<<18),
    RCC_CFGR_PLLMUL_16_gc           = (0x0E<<18),
    RCC_CFGR_PLLMUL_17_gc           = (0x0F<<18),
    RCC_CFGR_PLLXTPRE_NODIV_gc      = (0x00<<17),
    RCC_CFGR_PLLXTPRE_DIVBY2_gc     = (0x01<<17),
    RCC_CFGR_PLLSRC_HSIDIVBY2_gc    = (0x00<<16),
    RCC_CFGR_PLLSRC_HSEDIV_gc       = (0x01<<16),
    RCC_CFGR_PPRE2_NODIV_gc         = (0x00<<11),
    RCC_CFGR_PPRE2_DIVBY2_gc        = (0x04<<11),
    RCC_CFGR_PPRE2_DIVBY4_gc        = (0x05<<11),
    RCC_CFGR_PPRE2_DIVBY8_gc        = (0x06<<11),
    RCC_CFGR_PPRE2_DIVBY16_gc       = (0x07<<11),
    RCC_CFGR_PPRE1_NODIV_gc         = (0x00<<8),
    RCC_CFGR_PPRE1_DIVBY2_gc        = (0x04<<8),
    RCC_CFGR_PPRE1_DIVBY4_gc        = (0x05<<8),
    RCC_CFGR_PPRE1_DIVBY8_gc        = (0x06<<8),
    RCC_CFGR_PPRE1_DIVBY16_gc       = (0x07<<8),
    RCC_CFGR_HPRE_NODIV_gc          = (0x00<<4),
    RCC_CFGR_HPRE_DIVBY2_gc         = (0x08<<4),
    RCC_CFGR_HPRE_DIVBY4_gc         = (0x09<<4),
    RCC_CFGR_HPRE_DIVBY8_gc         = (0x0A<<4),
    RCC_CFGR_HPRE_DIVBY16_gc        = (0x0B<<4),
    RCC_CFGR_HPRE_DIVBY64_gc        = (0x0C<<4),
    RCC_CFGR_HPRE_DIVBY128_gc       = (0x0D<<4),
    RCC_CFGR_HPRE_DIVBY256_gc       = (0x0E<<4),
    RCC_CFGR_HPRE_DIVBY512_gc       = (0x0F<<4),
    RCC_CFGR_SWS_HSI_gc             = (0x00<<2),
    RCC_CFGR_SWS_HSE_gc             = (0x01<<2),
    RCC_CFGR_SWS_PLL_gc             = (0x02<<2),
    RCC_CFGR_SW_HSI_gc              = (0x00<<0),
    RCC_CFGR_SW_HSE_gc              = (0x01<<0),
    RCC_CFGR_SW_PLL_gc              = (0x02<<0)
} RCC_CFGR_t;

#define RCC_CFGR_PLLNODIV_bm        (0x01<<31)
#define RCC_CFGR_MCOPRE_bm          (0x07<<29)
#define RCC_CFGR_MCOF_bm            (0x01<<28)
#define RCC_CFGR_MCO_bm             (0x07<<24)
#define RCC_CFGR_I2SSRC_bm          (0x01<<23)
#define RCC_CFGR_USBPRE_bm          (0x01<<22)
#define RCC_CFGR_PLLMUL_bm          (0x0F<<18)
#define RCC_CFGR_PLLXTPRE_bm        (0x01<<17)
#define RCC_CFGR_PLLSRC_bm          (0x01<<16)
#define RCC_CFGR_PPRE2_bm           (0x07<<11)
#define RCC_CFGR_PPRE1_bm           (0x07<<8)
#define RCC_CFGR_HPRE_bm            (0x0F<<4)
#define RCC_CFGR_SWS_bm             (0x03<<2)
#define RCC_CFGR_SW_bm              (0x03<<0)

typedef struct
{
    register32_t ACR;          // FLASH access control register,              Address offset: 0x00 
    register32_t KEYR;         // FLASH key register,                         Address offset: 0x04 
    register32_t OPTKEYR;      // FLASH option key register,                  Address offset: 0x08 
    register32_t SR;           // FLASH status register,                      Address offset: 0x0C 
    register32_t CR;           // FLASH control register,                     Address offset: 0x10 
    register32_t AR;           // FLASH address register,                     Address offset: 0x14 
    register32_t reserved_0x18;     // Reserved, 0x18                                                   
    register32_t OBR;          // FLASH Option byte register,                 Address offset: 0x1C 
    register32_t WRPR;         // FLASH Write register,                       Address offset: 0x20 
} FLASH_t;

