Hyvok/ARM-induction-heater-controller/src/stm32f30x_new.h
typedef enum
{
    FLASH_ACR_PRFTBS_EN_gc          = (0x01<<5),
    FLASH_ACR_PRFTBS_DIS_gc         = (0x00<<5),
    FLASH_ACR_PRFTBE_EN_gc          = (0x01<<4),
    FLASH_ACR_PRFTBE_DIS_gc         = (0x00<<4),
    FLASH_ACR_HLFCYA_EN_gc          = (0x01<<3),
    FLASH_ACR_HLFCYA_DIS_gc         = (0x00<<3),
    FLASH_ACR_LATENCY_0_gc          = (0x00),
    FLASH_ACR_LATENCY_1_gc          = (0x01),
    FLASH_ACR_LATENCY_2_gc          = (0x02)
} FLASH_ACR_t;

// FLASH_ACR bitfields
#define FLASH_ACR_PRFTBS_bm         (0x01<<5)
#define FLASH_ACR_PRFTBE_bm         (0x01<<4)
#define FLASH_ACR_HLFCYA_bm         (0x01<<3)
#define FLASH_ACR_LATENCY_bm        (0x02)


typedef struct 
{
    register32_t CPUID;                   // Offset: 0x000 (R/ )  CPUID Base Register                                   
    register32_t ICSR;                    // Offset: 0x004 (R/W)  Interrupt Control and State Register                  
    register32_t VTOR;                    // Offset: 0x008 (R/W)  Vector Table Offset Register                          
    register32_t AIRCR;                   // Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register      
    register32_t SCR;                     // Offset: 0x010 (R/W)  System Control Register                               
    register32_t CCR;                     // Offset: 0x014 (R/W)  Configuration Control Register                        
    register8_t  SHP[12];                 // Offset: 0x018 (R/W)  System Handlers Priority Registers (4-7, 8-11, 12-15) 
    register32_t SHCSR;                   // Offset: 0x024 (R/W)  System Handler Control and State Register             
    register32_t CFSR;                    // Offset: 0x028 (R/W)  Configurable Fault Status Register                    
    register32_t HFSR;                    // Offset: 0x02C (R/W)  HardFault Status Register                             
    register32_t DFSR;                    // Offset: 0x030 (R/W)  Debug Fault Status Register                           
    register32_t MMFAR;                   // Offset: 0x034 (R/W)  MemManage Fault Address Register                      
    register32_t BFAR;                    // Offset: 0x038 (R/W)  BusFault Address Register                             
    register32_t AFSR;                    // Offset: 0x03C (R/W)  Auxiliary Fault Status Register                       
    register32_t PFR[2];                  // Offset: 0x040 (R/ )  Processor Feature Register                            
    register32_t DFR;                     // Offset: 0x048 (R/ )  Debug Feature Register                                
    register32_t ADR;                     // Offset: 0x04C (R/ )  Auxiliary Feature Register                            
    register32_t MMFR[4];                 // Offset: 0x050 (R/ )  Memory Model Feature Register                         
    register32_t ISAR[5];                 // Offset: 0x060 (R/ )  Instruction Set Attributes Register                   
    register32_t RESERVED0[5];
    register32_t CPACR;                   // Offset: 0x088 (R/W)  Coprocessor Access Control Register                   
} SCB_t;

typedef enum
{
    GPIO_MODER_OUT_gc               = 0x01,
    GPIO_MODER_IN_gc                = 0x00,
    GPIO_MODER_AF_gc                = 0x02,
    GPIO_MODER_ANA_gc               = 0x03
} GPIO_MODER_t;

// MODER
#define GPIO_MODER_MODER0_bm        (0x03<<0)
#define GPIO_MODER_MODER1_bm        (0x03<<2)
#define GPIO_MODER_MODER2_bm        (0x03<<4)
#define GPIO_MODER_MODER3_bm        (0x03<<6)
#define GPIO_MODER_MODER4_bm        (0x03<<8)
#define GPIO_MODER_MODER5_bm        (0x03<<10)
#define GPIO_MODER_MODER6_bm        (0x03<<12)
#define GPIO_MODER_MODER7_bm        (0x03<<14)
#define GPIO_MODER_MODER8_bm        (0x03<<16)
#define GPIO_MODER_MODER9_bm        (0x03<<18)
#define GPIO_MODER_MODER10_bm       (0x03<<20)
#define GPIO_MODER_MODER11_bm       (0x03<<22)
#define GPIO_MODER_MODER12_bm       (0x03<<24)
#define GPIO_MODER_MODER13_bm       (0x03<<26)
#define GPIO_MODER_MODER14_bm       (0x03<<28)
#define GPIO_MODER_MODER15_bm       (0x03<<30)

typedef enum
{
   GPIO_OTYPER_PP_gc                = 0x00,
   GPIO_OTYPER_OD_gc                = 0x01
} GPIO_OTYPER_t;

// OTYPER
#define GPIO_OTYPER_OT0_bm          (0x01<<0)
#define GPIO_OTYPER_OT1_bm          (0x01<<1)
#define GPIO_OTYPER_OT2_bm          (0x01<<2)
#define GPIO_OTYPER_OT3_bm          (0x01<<3)
#define GPIO_OTYPER_OT4_bm          (0x01<<4)
#define GPIO_OTYPER_OT5_bm          (0x01<<5)
#define GPIO_OTYPER_OT6_bm          (0x01<<6)
#define GPIO_OTYPER_OT7_bm          (0x01<<7)
#define GPIO_OTYPER_OT8_bm          (0x01<<8)
#define GPIO_OTYPER_OT9_bm          (0x01<<9)
#define GPIO_OTYPER_OT10_bm         (0x01<<10)
#define GPIO_OTYPER_OT11_bm         (0x01<<11)
#define GPIO_OTYPER_OT12_bm         (0x01<<12)
#define GPIO_OTYPER_OT13_bm         (0x01<<13)
#define GPIO_OTYPER_OT14_bm         (0x01<<14)
#define GPIO_OTYPER_OT15_bm         (0x01<<15)

typedef enum
{
    GPIO_OSPEEDR_LOW_gc             = 0x00,
    GPIO_OSPEEDR_MED_gc             = 0x01,
    GPIO_OSPEEDR_HI_gc              = 0x03
} GPIO_OSPEEDR_t;

// OSPEEDR
#define GPIO_OSPEEDR_OSPEEDR0_bm    (0x03<<0)
#define GPIO_OSPEEDR_OSPEEDR1_bm    (0x03<<2)
#define GPIO_OSPEEDR_OSPEEDR2_bm    (0x03<<4)
#define GPIO_OSPEEDR_OSPEEDR3_bm    (0x03<<6)
#define GPIO_OSPEEDR_OSPEEDR4_bm    (0x03<<8)
#define GPIO_OSPEEDR_OSPEEDR5_bm    (0x03<<10)
#define GPIO_OSPEEDR_OSPEEDR6_bm    (0x03<<12)
#define GPIO_OSPEEDR_OSPEEDR7_bm    (0x03<<14)
#define GPIO_OSPEEDR_OSPEEDR8_bm    (0x03<<16)
#define GPIO_OSPEEDR_OSPEEDR9_bm    (0x03<<18)
#define GPIO_OSPEEDR_OSPEEDR10_bm   (0x03<<20)
#define GPIO_OSPEEDR_OSPEEDR11_bm   (0x03<<22)
#define GPIO_OSPEEDR_OSPEEDR12_bm   (0x03<<24)
#define GPIO_OSPEEDR_OSPEEDR13_bm   (0x03<<26)
#define GPIO_OSPEEDR_OSPEEDR14_bm   (0x03<<28)
#define GPIO_OSPEEDR_OSPEEDR15_bm   (0x03<<30)

typedef enum
{
    GPIO_PUPDR_NONE_gc              = 0x00,
    GPIO_PUPDR_PULLUP_gc            = 0x01,
    GPIO_PUPDR_PULLDOWN_gc          = 0x02
} GPIO_PUPDR_t;

// PUPDR
#define GPIO_PUPDR_PUPDR0_bm        (0x03<<0)
#define GPIO_PUPDR_PUPDR1_bm        (0x03<<2)
#define GPIO_PUPDR_PUPDR2_bm        (0x03<<4)
#define GPIO_PUPDR_PUPDR3_bm        (0x03<<6)
#define GPIO_PUPDR_PUPDR4_bm        (0x03<<8)
#define GPIO_PUPDR_PUPDR5_bm        (0x03<<10)
#define GPIO_PUPDR_PUPDR6_bm        (0x03<<12)
#define GPIO_PUPDR_PUPDR7_bm        (0x03<<14)
#define GPIO_PUPDR_PUPDR8_bm        (0x03<<16)
#define GPIO_PUPDR_PUPDR9_bm        (0x03<<18)
#define GPIO_PUPDR_PUPDR10_bm       (0x03<<20)
#define GPIO_PUPDR_PUPDR11_bm       (0x03<<22)
#define GPIO_PUPDR_PUPDR12_bm       (0x03<<24)
#define GPIO_PUPDR_PUPDR13_bm       (0x03<<26)
#define GPIO_PUPDR_PUPDR14_bm       (0x03<<28)
#define GPIO_PUPDR_PUPDR15_bm       (0x03<<30)

