Hyvok/ARM-induction-heater-controller/src/stm32f30x_new.h
typedef enum
{
    GPIO_PIN_0                      = 0x00,
    GPIO_PIN_1                      = 0x01,
    GPIO_PIN_2                      = 0x02,
    GPIO_PIN_3                      = 0x03,
    GPIO_PIN_4                      = 0x04,
    GPIO_PIN_5                      = 0x05,
    GPIO_PIN_6                      = 0x06,
    GPIO_PIN_7                      = 0x07,
    GPIO_PIN_8                      = 0x08,
    GPIO_PIN_9                      = 0x09,
    GPIO_PIN_10                     = 0x0A,
    GPIO_PIN_11                     = 0x0B,
    GPIO_PIN_12                     = 0x0C,
    GPIO_PIN_13                     = 0x0D,
    GPIO_PIN_14                     = 0x0E,
    GPIO_PIN_15                     = 0x0F
} GPIO_PIN_t;  

// Base memory addresses
#define FLASH_BASE                  (0x08000000) // FLASH base address in the alias region 
#define SRAM_BASE                   (0x20000000) // SRAM base address in the alias region 
#define SCS_BASE                    (0xE000E000UL)                            // System Control Space Base Address  
#define SCB_BASE                    (SCS_BASE +  0x0D00UL)                    // System Control Block Base Address  
#define PERIPH_BASE                 0x40000000 // Peripheral base address in the alias region 
#define AHB1PERIPH_BASE             (PERIPH_BASE + 0x00020000)
#define AHB2PERIPH_BASE             (PERIPH_BASE + 0x08000000)
#define APB2PERIPH_BASE             (PERIPH_BASE + 0x00010000)

// APB2 peripherals
#define TIM1        (*(AC_TIM_t *)  (APB2PERIPH_BASE + 0x00002C00))
#define TIM8        (*(AC_TIM_t *)  (APB2PERIPH_BASE + 0x00003400))

// AHB1 peripherals
#define RCC         ((RCC_t *)      (AHB1PERIPH_BASE + 0x00001000))
#define FLASH       ((FLASH_t *)    (AHB1PERIPH_BASE + 0x00002000))

// AHB2 peripherals
#define GPIOA       (*(GPIO_t *)    (AHB2PERIPH_BASE + 0x0000))
#define GPIOB       (*(GPIO_t *)    (AHB2PERIPH_BASE + 0x0400))
#define GPIOC       (*(GPIO_t *)    (AHB2PERIPH_BASE + 0x0800))
#define GPIOD       (*(GPIO_t *)    (AHB2PERIPH_BASE + 0x0C00))
#define GPIOE       (*(GPIO_t *)    (AHB2PERIPH_BASE + 0x1000))
#define GPIOF       (*(GPIO_t *)    (AHB2PERIPH_BASE + 0x1400))

// Cortex-M4 core registers
#define SCB         ((SCB_t *)      SCB_BASE)   // SCB configuration struct           

// Random defines
#define VECT_TAB_OFFSET             (0x00)
#define HSI_STARTUP_TIMEOUT         (0x5000) // Time out for HSI start up 

